# Projeto 1 - Ciência dos Dados

Nome: Roberto Schnorrenberg

## Pergunta (s) a ser respondida

Os países que se integraram ao OCDE (Organização para Cooperação e Desenvolvimento Econômico) aumentaram o número de bilionários e dimínuiram o número de suicídios em suas províncias relacionados aos países de fora do bloco?

## Explicação da hipótese e mecanismo

Atualmente a OCDE é uma organização internacional com o objetivo de fomentar e incentivar ações de desenvolvimento econômico de seus países, além de medidas que visem à ampliação de metas para o equilíbrio econômico mundial e melhorem as condições de vida e os índices de renda e emprego.

Portanto, com a diminuição do desemprego e a melhora das condições de vida em geral há uma hipótese de que o número de bilionários aumente e o número de suicídos diminua nos países participantes do bloco.

Diante disso, os dados de renda nacional líquida per capita e o índice de desemprego serão observados para propor uma correlação ao número de bilionários e suicídios de países de dentro e fora do bloco no ano de 2005, explicitando, se houver, alguma diferença entre os dados dos integrantes e não integrantes da organização internacional. Já que é comum imaginar que um país com  melhores condições de vida e um pequeno índice de desemprego acaba gerando uma diminuição no número de suicídios ou no aumento de bilionários do país. Logo, esse projeto tem como função esclarecer a relação desses dados.

Como referência para transpor tal hipótese segue o estudo do site: https://www.bbc.com/portuguese/geral-48890430(https://www.insper.edu.br/biblioteca-telles/recursos-de-busca/)

## Bases de dados usadas

link para o site de download das bases de dados = https://www.gapminder.org/data/ 

Foram coletados os seguintes dados:

- Renda nacional líquida ajustada per capita
- Ìndice de desemprego de indivíduos entre 25 a 54 anos
- Número de bilionários
- Número de suicídios

## Análise de dados

Insira abaixo uma análise de dados tratada para ter maior clareza. 

Lembre-se de que, além deste arquivo principal, você precisa entregar um ou mais *notebooks* mais brutos com todas as tentativas que fez e que não deram certo .

**Não inclua dados ou gráficos sem motivação nem interpretação** - sempre que fizer uma análise, plot ou tablea, diga qual sua intenção. Logo após a apresentação diga qual conclusão específica ou interpretação você tira daquela análise

In [193]:
%matplotlib inline
import pandas as pd
import numpy as np
import math as math
from scipy import stats
import matplotlib.pyplot as plt
import seaborn as sns

In [194]:
renda=pd.read_excel('renda_certa.xlsx')
desemprego=pd.read_excel('aged_15plus_unemployment_rate_percent.xlsx')
bilionarios=pd.read_excel('dollar_billionaires.xlsx')
suicidios=pd.read_excel('suicide_total_deaths.xlsx')

In [195]:
renda_2005 = renda.loc[:, ["country", 2005]]
renda_2005.head()

       country    2005
0  Afghanistan     NaN
1      Albania  2500.0
2      Algeria  2060.0
3       Angola   564.0
4    Argentina  3790.0

In [196]:
desemprego_2005 = desemprego.loc[:,['country', 2005]]
desemprego_2005.head()

               country  2005
0          Afghanistan   NaN
1              Albania   NaN
2              Algeria  15.3
3               Angola   NaN
4  Antigua and Barbuda   NaN

In [197]:
bilionarios_2005 = bilionarios.loc[:,['country', 2005]] 
bilionarios_2005.head()

       country  2005
0  Afghanistan   0.0
1      Albania   0.0
2      Algeria   0.0
3      Andorra   0.0
4       Angola   0.0

In [198]:
suicidios_2005 = suicidios.loc[:,['country', 2005]]
suicidios_2005.head()

       country     2005
0  Afghanistan  1600.00
1      Albania   204.00
2      Algeria  1210.00
3      Andorra     7.04
4       Angola   980.00

In [199]:
renda_idx = renda_2005.set_index('country')

In [200]:
desemprego_idx = desemprego_2005.set_index('country')

In [201]:
bilionarios_idx = bilionarios_2005.set_index('country')

In [202]:
suicidios_idx = suicidios_2005.set_index('country')

In [203]:
renda_desemprego = renda_idx.join(desemprego_idx, how='inner', lsuffix='_renda', rsuffix='_dspg')
renda_desemprego.head()

             2005_renda  2005_dspg
country
Afghanistan         NaN        NaN
Albania          2500.0        NaN
Algeria          2060.0       15.3
Angola            564.0        NaN
Argentina        3790.0       11.5

In [204]:
bili_sui = bilionarios_idx.join(suicidios_idx, how='inner', lsuffix='_bln', rsuffix='_scd')
bili_sui.head()

             2005_bln  2005_scd
country
Afghanistan       0.0   1600.00
Albania           0.0    204.00
Algeria           0.0   1210.00
Andorra           0.0      7.04
Angola            0.0    980.00

In [205]:
tab = renda_desemprego.join(bili_sui, how='inner')
tab.head()

             2005_renda  2005_dspg  2005_bln  2005_scd
country
Afghanistan         NaN        NaN    0.0000    1600.0
Albania          2500.0        NaN    0.0000     204.0
Algeria          2060.0       15.3    0.0000    1210.0
Angola            564.0        NaN    0.0000     980.0
Argentina        3790.0       11.5    0.0253    4470.0

In [207]:
tab['OCDE']='Não'
lista_OCDE=['Germany','Australia', 'Austria', 'Belgium', 'Canada', 'Chile', 'South Korea', 'Denmark', 'Slovenia', 'Spain', 'United States', 'Estonia', 'Finland', 'France', 'Greece', 'Hungary', 'Ireland', 'Iceland', 'Israel', 'Italy', 'Japan', 'Latvia', 'Luxembourg', 'Mexico', 'Norway', 'New Zealand', 'Netherlands', 'Peru', 'Poland', 'Portugal', 'United Kingdom']
tab.loc[lista_OCDE, 'OCDE']='Sim'
tab.head()

             2005_renda  2005_dspg  2005_bln  2005_scd OCDE
country
Afghanistan         NaN        NaN    0.0000    1600.0  Não
Albania          2500.0        NaN    0.0000     204.0  Não
Algeria          2060.0       15.3    0.0000    1210.0  Não
Angola            564.0        NaN    0.0000     980.0  Não
Argentina        3790.0       11.5    0.0253    4470.0  Não

## Conclusão

Responda à pergunta, argumento da melhor forma possível com base nos dados